export class AcademyFakeDb
{
    public static courses = [
        {
            'id'      : '15459251a6d6b397565',
            'title'   : 'فوائد الفواكه',
            'slug'    : 'فوائد الفواكه',
            'category': 'فواكه',
            'updated' : 'كانون الثاني 28, 2017'
        },
        {
            'id'      : '154588a0864d2881124',
            'title'   : 'أنواع الفواكه',
            'slug'    : 'أنواع الفواكه',

            'category': 'فواكه',
            'updated' : 'تشرين الأول 01, 2017'
        },
        {
            'id'      : '15453ba60d3baa5daaf',
            'title'   : 'فوائد الخضار',
            'slug'    : 'فوائد الخضار',
            'category': 'خضار',
            'updated' : 'اذار 28, 2017'
        },
        {
            'id'      : '15453a06c08fb021776',
            'title'   : 'أنواع الخضار',
            'slug'    : 'أنواع الخضار',

            'category': 'خضار',
            'updated' : 'أيلول 28, 2017'
        },
        {
            'id'      : '1543ee3a5b43e0f9f45',
            'title'   : 'فوائد الورقيات',
            'slug'    : 'فوائد الورقيات',
            'category': 'أوراق',
            'updated' : 'نيسان 28, 2017'
        },
        {
            'id'      : '1543cc4515df3146112',
            'title'   : '  أنواع الورقيات',
            'slug'    : '  أنواع الورقيات  ',
            'category': 'أوراق',
            'updated' : 'نيسان 28, 2017'
        },
        {
            'id'      : '154398a4770d7aaf9a2',
            'title'   : 'أطباق خاصة بالخضار والورقيات',
            'slug'    : ' أطباق خاصة بالخضار والورقيات',
            'category': 'أطباق',
            'updated' : 'حزيران 28, 2017'
        },
        {
            'id'      : '154297167e781781745',
            'title'   : 'أطباق خاصة بالفواكه',
            'slug'    : 'أطباق خاصة بالفواكه',
            'category': 'أطباق',
            'updated' : 'شباط 28, 2017'
        },
    ];

    public static categories = [
        {
            'id'   : 0,
            'value': 'فواكه',
            'label': 'فواكه'
        },
        {
            'id'   : 1,
            'value': 'خضار',
            'label': 'خضار'
        },
        {
            'id'   : 2,
            'value': 'أوراق',
            'label': 'أوراق'
        },
        {
            'id'   : 3,
            'value': 'أطباق',
            'label': 'أطباق'
        }
    ];

    private static demoSteps = [
        {    
            'title'  : 'فوائد الفواكه',
             'image' : '1' ,
            'content': '<h1>الخطوة الأولى- فوائد الفواكه </h1>' + 
            '<br>' +
            'ينصح بتناول الفاكهة على معدة فارغة لاحتوائها على سكاكر بسيطة، مما يؤدي إلى إبطاء عملية الهضم والامتصاص عند تناولها مباشرة بعد الطعام إذ تحتوي الفواكه على فيتامينات وعناصر مهمة مثل الكالسيوم الذي يساعد على تقوية العظام وعدم الإصابة بهشاشة العظام والعديد من الفوائد...إلخ حيث لا يستطيع أي إنسان الاستغناء عن النبات والفواكه سواء بطريقة مباشرة أو غير مباشرة.' +
            '<br><br>' +
            'كما أن الفواكه تحتوي على ألياف تسهل عمل الأمعاء والإخراج. كما توجد في الفواكه مواد تساعد على المحافظة على الشباب وتخفيف متاعب الكهولة. والفواكه تساعد على معادلة السموم وإبطال عملها الضار للجسم. وهى مفيدة جدًا للحصول على الفتامين كما نوصي عند عسر الهضم بأكل فاكهة البطيخ والتي لها فوائد عظيمة في مرض عسر الهضم</b>.'
        },
        {
            'title'  : 'أنواع الفواكه',
            'image' : '1' ,
            'content': '<h1>الخطوة الثانية- أنواع الفواكه</h1>' +
            '<br>' +
            ' الليمون ' +
            'يحتوي الليمون على فيتامين سي إضافة إلى الحديد وحمض الستريك وهو يحافظ على البشرة ,إذ ينصح به ايضاً للمصابين بالزكام'
        },
        {
            'title'  : 'فوائد الخضار',
            'image' : '1' ,
            'content': '<h1> الخطوة الثالثة- فوائد الخضار</h1>' +
            '<br>' +
            'تباع نظام غذائي غني بالخضراوات قد يقلل من خطر الإصابة بالسكتة الدماغية والسرطان والعديد من الأمراض الأخرى، تعرف على فوائد الخضراوات الآن.' +
            '<br><br>' +
            'تناول الخضراوات لا يقتصر على من يطمحون إلى خسارة الوزن أو الحفاظ عليه، فقد وجد ان الذين يتناولون الخضراوات والفواكه من ضمن وجباتهم اليومية لديهم خطر الإصابة بالعديد من الأمراض المزمنة</b>.'
        },
        {
            'title'  : 'انواع الخضار ',
            'image' : '1' ,
            'content': '<h1> الخطوة الرابعة- أنواع الخضار</h1>' +
            '<br>' +
            ' الخس' +
            ' يعد الخس مصدرًا منخفضًا للسعرات الحرارية وتقريبًا لا يحوي أي دهون، فالمئة غرام من أوراق الخس الطازجة سعراتها الحرارية لا تزيد عن 14 سعر حراري ونسبة دهون لا تتعدى 0.14 غرام. ' +
            '<br><br>' +
            ' لهذا السبب فالخس يعد غذاءً مثاليًا لمن يطمحون بخسارة الوزن أو السيطرة عليه، فضلًا عن كونه مصدر غني للألياف الغذائية التي تساهم في زيادة الإحساس بالشبع وتقليل كمية الطعام المتناولة خلال اليوم' 
        },
        {    
            'title'  : 'فوائد الفواكه',
             'image' : '1' ,
            'content': '<h1> الخطوة الخامسة- فوائد الفواكه </h1>' + 
            '<br>' +
            'ينصح بتناول الفاكهة على معدة فارغة لاحتوائها على سكاكر بسيطة، مما يؤدي إلى إبطاء عملية الهضم والامتصاص عند تناولها مباشرة بعد الطعام إذ تحتوي الفواكه على فيتامينات وعناصر مهمة مثل الكالسيوم الذي يساعد على تقوية العظام وعدم الإصابة بهشاشة العظام والعديد من الفوائد...إلخ حيث لا يستطيع أي إنسان الاستغناء عن النبات والفواكه سواء بطريقة مباشرة أو غير مباشرة.' +
            '<br><br>' +
            'كما أن الفواكه تحتوي على ألياف تسهل عمل الأمعاء والإخراج. كما توجد في الفواكه مواد تساعد على المحافظة على الشباب وتخفيف متاعب الكهولة. والفواكه تساعد على معادلة السموم وإبطال عملها الضار للجسم. وهى مفيدة جدًا للحصول على الفتامين كما نوصي عند عسر الهضم بأكل فاكهة البطيخ والتي لها فوائد عظيمة في مرض عسر الهضم</b>.'
        },
        {
            'title'  : 'أنواع الفواكه',
            'image' : '1' ,
            'content': '<h1> الخطوة السادسة- أنواع الفواكه</h1>' +
            '<br>' +
            ' الليمون ' +
            'يحتوي الليمون على فيتامين سي إضافة إلى الحديد وحمض الستريك وهو يحافظ على البشرة ,إذ ينصح به ايضاً للمصابين بالزكام'
        },
        {
            'title'  : 'فوائد الخضار',
            'image' : '1' ,
            'content': '<h1> الخطوة السابعة- فوائد الخضار </h1>' +
            '<br>' +
            'تباع نظام غذائي غني بالخضراوات قد يقلل من خطر الإصابة بالسكتة الدماغية والسرطان والعديد من الأمراض الأخرى، تعرف على فوائد الخضراوات الآن.' +
            '<br><br>' +
            'تناول الخضراوات لا يقتصر على من يطمحون إلى خسارة الوزن أو الحفاظ عليه، فقد وجد ان الذين يتناولون الخضراوات والفواكه من ضمن وجباتهم اليومية لديهم خطر الإصابة بالعديد من الأمراض المزمنة</b>.'
        },
        {
            'title'  : 'انواع الخضار ',
            'image' : '1' ,
            'content': '<h1> الخطوة الثامنة- أنواع الخضار</h1>' +
            '<br>' +
            ' الخس' +
            ' يعد الخس مصدرًا منخفضًا للسعرات الحرارية وتقريبًا لا يحوي أي دهون، فالمئة غرام من أوراق الخس الطازجة سعراتها الحرارية لا تزيد عن 14 سعر حراري ونسبة دهون لا تتعدى 0.14 غرام. ' +
            '<br><br>' +
            ' لهذا السبب فالخس يعد غذاءً مثاليًا لمن يطمحون بخسارة الوزن أو السيطرة عليه، فضلًا عن كونه مصدر غني للألياف الغذائية التي تساهم في زيادة الإحساس بالشبع وتقليل كمية الطعام المتناولة خلال اليوم' 
        },
    ];

    public static course = [
        {
            'id'         : '15459251a6d6b397565',
            'title'      : 'فوائد الفواكه',
            'slug'       : 'فوائد الفواكه',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'فواكه',
            'length'     : 30,
            'totalSteps' : 8,
            'updated' : 'كانون الثاني 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '154588a0864d2881124',
            'title'      : 'أنواع الفواكه',
            'slug'       : 'أنواع الفواكه',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'فواكه',
            'totalSteps' : 8,
            'updated' : 'تشرين الأول 01, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '15453ba60d3baa5daaf',
            'title'      : 'فوائد الخضار',
            'slug'       : 'فوائد الخضار',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'خضار',
            'totalSteps' : 8,
            'updated'    : 'اذار 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '15453a06c08fb021776',
            'title'      : 'أنواع الخضار',
            'slug'       : 'أنواع الخضار',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'خضار',
            'totalSteps' : 8,
            'updated' : 'أيلول 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },  
        {
            'id'         : '1543ee3a5b43e0f9f45',
            'title'      : 'فوائد الورقيات ',
            'slug'       : 'فوائد الورقيات',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'أوراق',
            'totalSteps' : 8,
            'updated' : 'نيسان 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '1543cc4515df3146112',
            'title'      : 'انواع الورقيات',
            'slug'       : 'أنواع الورقيات',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'أوراق',
            'totalSteps' : 8,
            'updated' : 'نيسان 28, 2017' ,
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '154297167e781781745',
            'title'      : 'أطباق من الفواكه',
            'slug'       : 'أطباق من الفواكه',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'أطباق',
            'totalSteps' : 8,
            'updated' : 'حزيران 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
        {
            'id'         : '154398a4770d7aaf9a2',
            'title'      : 'أطباق من الخضار والورقيات',
            'slug'       : 'أطباق من الخضار والورقيات',
            'description': 'Commits that need to be pushed lorem ipsum dolor sit amet, consectetur adipiscing elit.',
            'category'   : 'أطباق',
            'totalSteps' : 8,
            'updated' : 'شباط 28, 2017',
            'steps'      : AcademyFakeDb.demoSteps

        },
    ];

}
