export class FaqFakeDb
{
    public static data = [
        {
            'question': 'من نحن؟',
            'answer': '.مجموعة من الطلاب نحاول مساعدة مجتمعنا في الوضع الراهن'
        },
        {
            'question': 'لماذا قمنا بإنشاء المنصة؟',
            'answer': '.من أجل توفير الوقت والجهد على المواطنين بدلا من إضاعة الوقت لساعات لجلب متطلبات المنزل اليومية '
        },
        {
            'question': 'كيف يمكن توصيل المتطلبات إذا ؟',
            'answer': ' .لا تقلق ستصل من خلالنا إلى منزلك مباشرة في غضون ساعتين على الأكثر '
        },
        {
            'question': 'هل منتجاتكم ستكون ذات جودة عالية؟',
            'answer': '.بالطبع ستكون وذلك من خلال عامل التوصيل الذي سيتفقدها قبل ان يقوم بحملها إليكم  '
        }, 
    ];
}
